app/views/users/show.html.erb

SELECT "users".* FROM "users"
---
<div class="container">
		        	<% @users = User.all %>