app/controllers/bookings_controller.rb

  def index
    @bookings = Booking.where("tennis_court_id = ? AND end_time >= ?", @tennis_court.id, Time.now).order(:start_time)
---
SELECT "bookings".* FROM "bookings" WHERE (tennis_court_id = 1 AND end_time >= '2015-06-30 03:45:31.866500')  ORDER BY "bookings"."start_time" ASC

  def create
    @booking =  current_user.bookings.build(params[:booking].permit(:tennis_court_id, :start_time, :length))
    # Booking.new
    @booking.tennis_court = @tennis_court
    if @booking.save
---
INSERT INTO "bookings" ("user_id", "length", "start_time", "tennis_court_id", "end_time") VALUES (?, ?, ?, ?, ?)  [["user_id", 1], ["length", 3], ["start_time", "2015-07-28 01:00:00.000000"], ["tennis_court_id", 1], ["end_time", "2015-07-28 03:59:00.000000"]]

  def find_tennis_court
    if params[:tennis_court_id]
      @tennis_court = TennisCourt.find_by_id(params[:tennis_court_id])
---
SELECT  "tennis_courts".* FROM "tennis_courts" WHERE "tennis_courts"."id" = ? LIMIT 1  [["id", 1]]