app/controllers/leads_controller.rb

INSERT INTO "leads" ("name", "email", "devise", "social_media", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["name", ""], ["email", ""], ["devise", ""], ["social_media", ""], ["created_at", "2015-07-19 08:32:38.708718"], ["updated_at", "2015-07-19 08:32:38.708718"]]
---
	def create
		@lead = Lead.new lead_params
		if @lead.save