app/controllers/tennis_courts_controller.rb

SELECT "tennis_courts".* FROM "tennis_courts"
---
  def index
    @tennis_courts = TennisCourt.all

INSERT INTO "tennis_courts" ("name") VALUES (?)  [["name", "kdjnkjef"]]
---
  def create
    @tennis_court = TennisCourt.create(tennis_court_params)