app/controllers/users_controller.rb

	def show
	  @user = User.find_by_name(params[:id])
---
SELECT  "users".* FROM "users" WHERE "users"."name" = ? LIMIT 1  [["name", "show"]]