app/views/profile/show.html.erb


  <% current_user.bookings.each do |booking| %>
---
SELECT "bookings".* FROM "bookings" WHERE "bookings"."user_id" = ?  [["user_id", 1]]